DataProcessors/сви_ВыгрузкаНоменклатуры.xml
<?xml version="1.0" encoding="UTF-8"?>
<MetaDataObject version="2.12">
	<DataProcessor>
		<Properties>
			<Name>сви_ВыгрузкаНоменклатуры</Name>
		</Properties>
		<ChildObjects>
			<Attribute>
				<Properties>
					<Name>МестоХранения</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.Склады</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>ТипЦен</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.ТипыЦенНоменклатуры</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>Валюта</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.Валюты</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>Подразделение</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.Подразделения</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>ТипЦенСтарая</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.ТипыЦенНоменклатуры</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>ВыгружатьНулевыеЦеныПрайс</Name>
					<Type>
						<v8:Type>xs:boolean</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>ВыгружатьНулевыеЦеныСтарая</Name>
					<Type>
						<v8:Type>xs:boolean</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>ВыгружатьНулевыеОстатки</Name>
					<Type>
						<v8:Type>xs:boolean</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>РежимОтбора</Name>
					<Type>
						<v8:Type>xs:string</v8:Type>
						<v8:StringQualifiers>
							<v8:Length>20</v8:Length>
						</v8:StringQualifiers>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>Компоновщик</Name>
					<Type>
						<v8:Type>dcsset:SettingsComposer</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>СхемаОбмена</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.сви_СхемыОбменаССайтом</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<TabularSection>
				<Properties>
					<Name>Товары</Name>
				</Properties>
				<ChildObjects>
					<Attribute>
						<Properties>
							<Name>Номенклатура</Name>
							<Type>
								<v8:Type>cfg:CatalogRef.Номенклатура</v8:Type>
							</Type>
						</Properties>
					</Attribute>
					<Attribute>
						<Properties>
							<Name>КодОтвета</Name>
							<Type>
								<v8:Type>xs:string</v8:Type>
								<v8:StringQualifiers>
									<v8:Length>10</v8:Length>
								</v8:StringQualifiers>
							</Type>
						</Properties>
					</Attribute>
					<Attribute>
						<Properties>
							<Name>ТекстОтвета</Name>
							<Type>
								<v8:Type>xs:string</v8:Type>
								<v8:StringQualifiers>
									<v8:Length>100</v8:Length>
								</v8:StringQualifiers>
							</Type>
						</Properties>
					</Attribute>
					<Attribute>
						<Properties>
							<Name>Результат</Name>
							<Type>
								<v8:Type>xs:string</v8:Type>
								<v8:StringQualifiers>
									<v8:Length>20</v8:Length>
								</v8:StringQualifiers>
							</Type>
						</Properties>
					</Attribute>
					<Attribute>
						<Properties>
							<Name>Цена</Name>
							<Type>
								<v8:Type>xs:decimal</v8:Type>
								<v8:NumberQualifiers>
									<v8:Digits>10</v8:Digits>
									<v8:FractionDigits>2</v8:FractionDigits>
								</v8:NumberQualifiers>
							</Type>
						</Properties>
					</Attribute>
					<Attribute>
						<Properties>
							<Name>ОтветЦена</Name>
							<Type>
								<v8:Type>xs:string</v8:Type>
								<v8:StringQualifiers>
									<v8:Length>100</v8:Length>
								</v8:StringQualifiers>
							</Type>
						</Properties>
					</Attribute>
					<Attribute>
						<Properties>
							<Name>Остаток</Name>
							<Type>
								<v8:Type>xs:decimal</v8:Type>
								<v8:NumberQualifiers>
									<v8:Digits>10</v8:Digits>
									<v8:FractionDigits>2</v8:FractionDigits>
								</v8:NumberQualifiers>
							</Type>
						</Properties>
					</Attribute>
					<Attribute>
						<Properties>
							<Name>ОтветОстаток</Name>
							<Type>
								<v8:Type>xs:string</v8:Type>
								<v8:StringQualifiers>
									<v8:Length>100</v8:Length>
								</v8:StringQualifiers>
							</Type>
						</Properties>
					</Attribute>
					<Attribute>
						<Properties>
							<Name>ИД</Name>
							<Type>
								<v8:Type>xs:string</v8:Type>
								<v8:StringQualifiers>
									<v8:Length>50</v8:Length>
								</v8:StringQualifiers>
							</Type>
						</Properties>
					</Attribute>
					<Attribute>
						<Properties>
							<Name>ЦенаСтарая</Name>
							<Type>
								<v8:Type>xs:decimal</v8:Type>
								<v8:NumberQualifiers>
									<v8:Digits>10</v8:Digits>
									<v8:FractionDigits>2</v8:FractionDigits>
								</v8:NumberQualifiers>
							</Type>
						</Properties>
					</Attribute>
					<Attribute>
						<Properties>
							<Name>ВыгружатьКартинки</Name>
							<Type>
								<v8:Type>xs:boolean</v8:Type>
							</Type>
						</Properties>
					</Attribute>
					<Attribute>
						<Properties>
							<Name>ОтветФото</Name>
							<Type>
								<v8:Type>xs:string</v8:Type>
								<v8:StringQualifiers>
									<v8:Length>200</v8:Length>
								</v8:StringQualifiers>
							</Type>
						</Properties>
					</Attribute>
					<Attribute>
						<Properties>
							<Name>Характеристика</Name>
							<Type>
								<v8:Type>cfg:CatalogRef.ХарактеристикиНоменклатуры</v8:Type>
							</Type>
						</Properties>
					</Attribute>
					<Attribute>
						<Properties>
							<Name>ДатаПроизводства</Name>
							<Type>
								<v8:Type>xs:string</v8:Type>
								<v8:StringQualifiers>
									<v8:Length>25</v8:Length>
								</v8:StringQualifiers>
							</Type>
						</Properties>
					</Attribute>
					<Attribute>
						<Properties>
							<Name>Страна</Name>
							<Type>
								<v8:Type>xs:string</v8:Type>
								<v8:StringQualifiers>
									<v8:Length>25</v8:Length>
								</v8:StringQualifiers>
							</Type>
						</Properties>
					</Attribute>
					<Attribute>
						<Properties>
							<Name>НашОстаток_СД</Name>
							<Type>
								<v8:Type>xs:decimal</v8:Type>
								<v8:NumberQualifiers>
									<v8:Digits>10</v8:Digits>
									<v8:FractionDigits>2</v8:FractionDigits>
								</v8:NumberQualifiers>
							</Type>
						</Properties>
					</Attribute>
					<Attribute>
						<Properties>
							<Name>ОстатокПоставщика_СД</Name>
							<Type>
								<v8:Type>xs:decimal</v8:Type>
								<v8:NumberQualifiers>
									<v8:Digits>10</v8:Digits>
									<v8:FractionDigits>2</v8:FractionDigits>
								</v8:NumberQualifiers>
							</Type>
						</Properties>
					</Attribute>
				</ChildObjects>
			</TabularSection>
		</ChildObjects>
	</DataProcessor>
</MetaDataObject>

InformationRegisters/мпи_ЗначенияКатегорийНоменклатуры.xml
<?xml version="1.0" encoding="UTF-8"?>
<MetaDataObject version="2.12">
	<InformationRegister>
		<Properties>
			<Name>мпи_ЗначенияКатегорийНоменклатуры</Name>
			<InformationRegisterPeriodicity>Nonperiodical</InformationRegisterPeriodicity>
			<WriteMode>Independent</WriteMode>
		</Properties>
		<ChildObjects>
			<Resource>
				<Properties>
					<Name>Основная</Name>
					<Type>
						<v8:Type>xs:boolean</v8:Type>
					</Type>
				</Properties>
			</Resource>
			<Dimension>
				<Properties>
					<Name>НоменклатураОбъект</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.Номенклатура</v8:Type>
					</Type>
				</Properties>
			</Dimension>
			<Dimension>
				<Properties>
					<Name>ВидКатегории</Name>
					<Type>
						<v8:Type>cfg:ChartOfCharacteristicTypesRef.мпи_ВидыКатегорийНоменклатуры</v8:Type>
					</Type>
				</Properties>
			</Dimension>
			<Dimension>
				<Properties>
					<Name>Значение</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.мпи_КатегорииНоменклатуры</v8:Type>
					</Type>
				</Properties>
			</Dimension>
		</ChildObjects>
	</InformationRegister>
</MetaDataObject>

InformationRegisters/Штрихкоды.xml
<?xml version="1.0" encoding="UTF-8"?>
<MetaDataObject version="2.12">
	<InformationRegister>
		<Properties>
			<Name>Штрихкоды</Name>
			<Comment>(Общ)</Comment>
			<InformationRegisterPeriodicity>Nonperiodical</InformationRegisterPeriodicity>
			<WriteMode>Independent</WriteMode>
		</Properties>
		<ChildObjects>
			<Resource>
				<Properties>
					<Name>УдалитьТипШтрихкода</Name>
					<Type>
						<v8:Type>cfg:ChartOfCharacteristicTypesRef.ТипыШтрихкодов</v8:Type>
					</Type>
				</Properties>
			</Resource>
			<Resource>
				<Properties>
					<Name>УдалитьШтрихкод</Name>
					<Type>
						<v8:TypeSet>cfg:Characteristic.ТипыШтрихкодов</v8:TypeSet>
					</Type>
				</Properties>
			</Resource>
			<Resource>
				<Properties>
					<Name>УдалитьВладелец</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.Номенклатура</v8:Type>
						<v8:Type>cfg:CatalogRef.ИнформационныеКарты</v8:Type>
					</Type>
				</Properties>
			</Resource>
			<Resource>
				<Properties>
					<Name>УдалитьЕдиницаИзмерения</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.ЕдиницыИзмерения</v8:Type>
					</Type>
				</Properties>
			</Resource>
			<Resource>
				<Properties>
					<Name>УдалитьХарактеристикаНоменклатуры</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.ХарактеристикиНоменклатуры</v8:Type>
					</Type>
				</Properties>
			</Resource>
			<Resource>
				<Properties>
					<Name>УдалитьСерияНоменклатуры</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.СерииНоменклатуры</v8:Type>
					</Type>
				</Properties>
			</Resource>
			<Resource>
				<Properties>
					<Name>УдалитьКачество</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.Качество</v8:Type>
					</Type>
				</Properties>
			</Resource>
			<Attribute>
				<Properties>
					<Name>ПредставлениеШтрихкода</Name>
					<Type>
						<v8:TypeSet>cfg:Characteristic.ТипыШтрихкодов</v8:TypeSet>
					</Type>
				</Properties>
			</Attribute>
			<Dimension>
				<Properties>
					<Name>Штрихкод</Name>
					<Type>
						<v8:TypeSet>cfg:Characteristic.ТипыШтрихкодов</v8:TypeSet>
					</Type>
				</Properties>
			</Dimension>
			<Dimension>
				<Properties>
					<Name>Владелец</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.Номенклатура</v8:Type>
						<v8:Type>cfg:CatalogRef.ИнформационныеКарты</v8:Type>
					</Type>
				</Properties>
			</Dimension>
			<Dimension>
				<Properties>
					<Name>ТипШтрихкода</Name>
					<Type>
						<v8:Type>cfg:ChartOfCharacteristicTypesRef.ТипыШтрихкодов</v8:Type>
					</Type>
				</Properties>
			</Dimension>
			<Dimension>
				<Properties>
					<Name>ЕдиницаИзмерения</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.ЕдиницыИзмерения</v8:Type>
					</Type>
				</Properties>
			</Dimension>
			<Dimension>
				<Properties>
					<Name>ХарактеристикаНоменклатуры</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.ХарактеристикиНоменклатуры</v8:Type>
					</Type>
				</Properties>
			</Dimension>
			<Dimension>
				<Properties>
					<Name>СерияНоменклатуры</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.СерииНоменклатуры</v8:Type>
					</Type>
				</Properties>
			</Dimension>
			<Dimension>
				<Properties>
					<Name>Качество</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.Качество</v8:Type>
					</Type>
				</Properties>
			</Dimension>
			<Dimension>
				<Properties>
					<Name>УдалитьКод</Name>
					<Type>
						<v8:Type>xs:decimal</v8:Type>
						<v8:NumberQualifiers>
							<v8:Digits>10</v8:Digits>
							<v8:FractionDigits>0</v8:FractionDigits>
						</v8:NumberQualifiers>
					</Type>
				</Properties>
			</Dimension>
		</ChildObjects>
	</InformationRegister>
</MetaDataObject>

AccumulationRegisters/ТоварыНаСкладах.xml
<?xml version="1.0" encoding="UTF-8"?>
<MetaDataObject version="2.12">
	<AccumulationRegister>
		<Properties>
			<Name>ТоварыНаСкладах</Name>
			<Comment>(Упр)</Comment>
			<RegisterType>Balance</RegisterType>
		</Properties>
		<ChildObjects>
			<Resource>
				<Properties>
					<Name>Количество</Name>
					<Type>
						<v8:Type>xs:decimal</v8:Type>
						<v8:NumberQualifiers>
							<v8:Digits>15</v8:Digits>
							<v8:FractionDigits>3</v8:FractionDigits>
						</v8:NumberQualifiers>
					</Type>
				</Properties>
			</Resource>
			<Dimension>
				<Properties>
					<Name>Склад</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.Склады</v8:Type>
					</Type>
				</Properties>
			</Dimension>
			<Dimension>
				<Properties>
					<Name>Номенклатура</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.Номенклатура</v8:Type>
					</Type>
				</Properties>
			</Dimension>
			<Dimension>
				<Properties>
					<Name>ХарактеристикаНоменклатуры</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.ХарактеристикиНоменклатуры</v8:Type>
					</Type>
				</Properties>
			</Dimension>
			<Dimension>
				<Properties>
					<Name>СерияНоменклатуры</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.СерииНоменклатуры</v8:Type>
					</Type>
				</Properties>
			</Dimension>
			<Dimension>
				<Properties>
					<Name>Качество</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.Качество</v8:Type>
					</Type>
				</Properties>
			</Dimension>
		</ChildObjects>
	</AccumulationRegister>
</MetaDataObject>

AccumulationRegisters/ТоварыВРезервеНаСкладах.xml
<?xml version="1.0" encoding="UTF-8"?>
<MetaDataObject version="2.12">
	<AccumulationRegister>
		<Properties>
			<Name>ТоварыВРезервеНаСкладах</Name>
			<Comment>(Упр)</Comment>
			<RegisterType>Balance</RegisterType>
		</Properties>
		<ChildObjects>
			<Resource>
				<Properties>
					<Name>Количество</Name>
					<Type>
						<v8:Type>xs:decimal</v8:Type>
						<v8:NumberQualifiers>
							<v8:Digits>15</v8:Digits>
							<v8:FractionDigits>3</v8:FractionDigits>
						</v8:NumberQualifiers>
					</Type>
				</Properties>
			</Resource>
			<Dimension>
				<Properties>
					<Name>Склад</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.Склады</v8:Type>
					</Type>
				</Properties>
			</Dimension>
			<Dimension>
				<Properties>
					<Name>Номенклатура</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.Номенклатура</v8:Type>
					</Type>
				</Properties>
			</Dimension>
			<Dimension>
				<Properties>
					<Name>ХарактеристикаНоменклатуры</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.ХарактеристикиНоменклатуры</v8:Type>
					</Type>
				</Properties>
			</Dimension>
			<Dimension>
				<Properties>
					<Name>ДокументРезерва</Name>
					<Type>
						<v8:Type>cfg:DocumentRef.ЗаказПокупателя</v8:Type>
						<v8:Type>cfg:DocumentRef.ПриходныйОрдерНаТовары</v8:Type>
						<v8:Type>cfg:DocumentRef.ВнутреннийЗаказ</v8:Type>
					</Type>
				</Properties>
			</Dimension>
			<Dimension>
				<Properties>
					<Name>СерияНоменклатуры</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.СерииНоменклатуры</v8:Type>
					</Type>
				</Properties>
			</Dimension>
		</ChildObjects>
	</AccumulationRegister>
</MetaDataObject>

InformationRegisters/сви_ИзмененияФотографийНоменклатуры.xml
<?xml version="1.0" encoding="UTF-8"?>
<MetaDataObject version="2.12">
	<InformationRegister>
		<Properties>
			<Name>сви_ИзмененияФотографийНоменклатуры</Name>
			<InformationRegisterPeriodicity>Nonperiodical</InformationRegisterPeriodicity>
			<WriteMode>Independent</WriteMode>
		</Properties>
		<ChildObjects>
			<Dimension>
				<Properties>
					<Name>Номенклатура</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.Номенклатура</v8:Type>
					</Type>
				</Properties>
			</Dimension>
		</ChildObjects>
	</InformationRegister>
</MetaDataObject>

DataProcessors/сви_ВыгрузкаНоменклатуры/Ext/ObjectModule.bsl
Перем мТекущаяНастройка Экспорт;
Перем НомерСообщения Экспорт;
Перем Узел Экспорт;

Процедура ВыгрузитьТовары() Экспорт
	спТоваров = Новый СписокЗначений;
	НастройкиПодключения = СхемаОбмена.НастройкаПодключения;
	Для Каждого Стр Из Товары Цикл
		СпТоваров.Добавить(Стр.Номенклатура);
	КонецЦикла;
	Успешно = Ложь;
	мпи_Доработки.ВыгрузкаТоваров_Хорошоп(СпТоваров,Товары,НастройкиПодключения, СхемаОбмена, Успешно);
	Если Успешно И ЗначениеЗаполнено(Узел) И ЗначениеЗаполнено(НомерСообщения) И ТипЗнч(Узел) = Тип("ПланОбменаСсылка.мпи_ОбменССайтомТовары") Тогда
		ПланыОбмена.УдалитьРегистрациюИзменений(Узел, НомерСообщения);
	КонецЕсли; 	
КонецПроцедуры

Процедура ЗаполнитьВсе() Экспорт
	
	Если НЕ ЗначениеЗаполнено(ТипЦен) Тогда
		Сообщить("Не выбран тип цен!");
		Возврат;
	КонецЕсли;
	Если НЕ ЗначениеЗаполнено(ТипЦенСтарая) Тогда
		Сообщить("Не выбран тип цен Старая!");
		Возврат;
	КонецЕсли;
	Если НЕ ЗначениеЗаполнено(Валюта) Тогда
		Сообщить("Не выбрана валюта!");
		Возврат;
	КонецЕсли;
	Узел = Неопределено;
	НомерСообщения = Неопределено;
	
	Товары.Очистить();
	Если РежимОтбора = "Расширенный" Тогда
		НоменклатураПоОтбору = ПолучитьНоменклатуруПоОтбору();
	Иначе
		НоменклатураПоОтбору = ПолучитьИзменения();
	КонецЕсли;	
	
	
	Если СхемаОбмена.ХранениеКатегорийСайта = Перечисления.сви_ВидыХраненияКатегорийСайта.ГруппыНоменклатуры Тогда
		Запрос = Новый Запрос;
		Запрос.Текст = 
		"ВЫБРАТЬ
		|	Номенклатура.Ссылка
		|ИЗ
		|	Справочник.Номенклатура КАК Номенклатура
		|ГДЕ
		|	НЕ Номенклатура.ЭтоГруппа
		|	И Номенклатура.Родитель.сви_ВыгружатьНаСайт";
		ПодлежитПередаче = Запрос.Выполнить().Выгрузить().ВыгрузитьКолонку("Ссылка");
		
	ИначеЕсли СхемаОбмена.ХранениеКатегорийСайта = Перечисления.сви_ВидыХраненияКатегорийСайта.КатегорииНоменклатуры Тогда
		Запрос = Новый Запрос;
		Запрос.Текст = 	
		"ВЫБРАТЬ РАЗЛИЧНЫЕ
		|	мпи_ЗначенияКатегорийНоменклатуры.НоменклатураОбъект
		|ИЗ
		|	РегистрСведений.мпи_ЗначенияКатегорийНоменклатуры КАК мпи_ЗначенияКатегорийНоменклатуры
		|ГДЕ
		|	мпи_ЗначенияКатегорийНоменклатуры.ВидКатегории = &ВидКатегории";
		Запрос.УстановитьПараметр("ВидКатегории", СхемаОбмена.ВидКатегорийНоменклатуры);
		ПодлежитПередаче = Запрос.Выполнить().Выгрузить().ВыгрузитьКолонку("НоменклатураОбъект");
	Иначе
		Сообщить("Не указан способ хранения категорий сайта");
		Возврат;
	КонецЕсли;
	
	ТекстЗапроса =
	
	"ВЫБРАТЬ
	|	Штрихкоды.Владелец,
	|	МАКСИМУМ(Штрихкоды.Штрихкод) КАК Штрихкод
	|ПОМЕСТИТЬ ШтрихкодыТоваров
	|ИЗ
	|	РегистрСведений.Штрихкоды КАК Штрихкоды
	|ГДЕ
	|	Штрихкоды.ХарактеристикаНоменклатуры = ЗНАЧЕНИЕ(Справочник.Характеристикиноменклатуры.пустаяСсылка)
	|	И &ИмяРеквизита = ""Штрихкод""
	|
	|СГРУППИРОВАТЬ ПО
	|	Штрихкоды.Владелец
	|;
	|
	|////////////////////////////////////////////////////////////////////////////////
	|ВЫБРАТЬ
	|	Штрихкоды.Владелец,
	|	МАКСИМУМ(Штрихкоды.Штрихкод) КАК Штрихкод,
	|	Штрихкоды.ХарактеристикаНоменклатуры
	|ПОМЕСТИТЬ ШтрихкодыХарактеристик
	|ИЗ
	|	РегистрСведений.Штрихкоды КАК Штрихкоды
	|ГДЕ
	|	Штрихкоды.ХарактеристикаНоменклатуры <> ЗНАЧЕНИЕ(Справочник.Характеристикиноменклатуры.пустаяСсылка)
	|	И &ИмяРеквизита = ""Штрихкод""
	|
	|СГРУППИРОВАТЬ ПО
	|	Штрихкоды.Владелец,
	|	Штрихкоды.ХарактеристикаНоменклатуры
	|;
	|
	|////////////////////////////////////////////////////////////////////////////////
	|ВЫБРАТЬ
	|	СпрНоменклатура.Ссылка КАК Номенклатура,
	|	ЕСТЬNULL(ХарактеристикиНоменклатуры.Ссылка, ЗНАЧЕНИЕ(Справочник.ХарактеристикиНоменклатуры.ПустаяСсылка)) КАК Характеристика
	|ПОМЕСТИТЬ ДанныеТоваров
	|ИЗ
	|	Справочник.Номенклатура КАК СпрНоменклатура
	|		ЛЕВОЕ СОЕДИНЕНИЕ Справочник.ХарактеристикиНоменклатуры КАК ХарактеристикиНоменклатуры
	|		ПО (ХарактеристикиНоменклатуры.Владелец = СпрНоменклатура.Ссылка)
	|			И (СпрНоменклатура.ВестиУчетПоХарактеристикам)
	|ГДЕ
	|	СпрНоменклатура.ЭтоГруппа = ЛОЖЬ
	|	И СпрНоменклатура.ПометкаУдаления = ЛОЖЬ
	|	И СпрНоменклатура.Ссылка В(&НоменклатураПоОтбору)
	|	И СпрНоменклатура.Ссылка В(&ПодлежитПередаче)
	|;
	|
	|////////////////////////////////////////////////////////////////////////////////
	|ВЫБРАТЬ
	|	Ном.Ссылка,
	|	ЕСТЬNULL(ВложенныйЗапрос1.Остаток, 0) КАК Остаток
	|ПОМЕСТИТЬ СД_ТоварыКонтрагента
	|ИЗ
	|	Справочник.Номенклатура КАК Ном
	|		ЛЕВОЕ СОЕДИНЕНИЕ (ВЫБРАТЬ
	|			ЦеныНоменклатурыКонтрагентовСрезПоследних.Номенклатура КАК Номенклатура,
	|			ЦеныНоменклатурыКонтрагентовСрезПоследних.Остаток КАК Остаток
	|		ИЗ
	|			РегистрСведений.ЦеныНоменклатурыКонтрагентов.СрезПоследних КАК ЦеныНоменклатурыКонтрагентовСрезПоследних";
	Если СхемаОбмена.ОтборОстатковПоГородам_СД или СхемаОбмена.ОтборОстатковПоПоставщикам_СД Тогда
		ТекстЗапроса = ТекстЗапроса +"
		|		ГДЕ";
	КонецЕсли;
	Если СхемаОбмена.ОтборОстатковПоГородам_СД Тогда
		Если СхемаОбмена.ИсключатьГорода_СД Тогда
			ТекстЗапроса = ТекстЗапроса +"
			|		НЕ 	ЦеныНоменклатурыКонтрагентовСрезПоследних.МІСТО В(&ГОРОДА)"; 
		Иначе
			ТекстЗапроса = ТекстЗапроса +"
			|			ЦеныНоменклатурыКонтрагентовСрезПоследних.МІСТО В(&ГОРОДА)"; 
		КонецЕсли;
	КонецЕсли;
	Если СхемаОбмена.ОтборОстатковПоПоставщикам_СД Тогда 
		Если СхемаОбмена.ОтборОстатковПоГородам_СД Тогда
			ТекстЗапроса = ТекстЗапроса +"
			|			И ";	
		КонецЕсли;
		
		Если СхемаОбмена.ИсключатьПоставщиков_СД Тогда
			ТекстЗапроса = ТекстЗапроса +"
			|		НЕ 	ЦеныНоменклатурыКонтрагентовСрезПоследних.Поставщик В(&Поставщик)"; 
		Иначе
			ТекстЗапроса = ТекстЗапроса +"
			|			ЦеныНоменклатурыКонтрагентовСрезПоследних.Поставщик В(&Поставщик)"; 
		КонецЕсли;
	КонецЕсли; 
	
	Если СхемаОбмена.ОтборОстатковПоКонтрагентам_СД Тогда 
		Если СхемаОбмена.ОтборОстатковПоГородам_СД или СхемаОбмена.ОтборОстатковПоПоставщикам_СД Тогда
			ТекстЗапроса = ТекстЗапроса +"
			|			И ";	
		КонецЕсли;
		
		Если СхемаОбмена.ИсключатьКонтрагентов_СД Тогда
			ТекстЗапроса = ТекстЗапроса +"
			|		НЕ 	ЦеныНоменклатурыКонтрагентовСрезПоследних.ТипЦен.Владелец В(&Контрагенты)"; 
		Иначе
			ТекстЗапроса = ТекстЗапроса +"
			|			ЦеныНоменклатурыКонтрагентовСрезПоследних.ТипЦен.Владелец В(&Контрагенты)"; 
		КонецЕсли;
	КонецЕсли;

	
	ТекстЗапроса = ТекстЗапроса + ") КАК ВложенныйЗапрос1
	|		ПО Ном.Ссылка = ВложенныйЗапрос1.Номенклатура
	|;
	|
	|////////////////////////////////////////////////////////////////////////////////
	|
	|ВЫБРАТЬ
	|	ДанныеТоваров.Характеристика,
	|	ДанныеТоваров.Характеристика.сви_КодВэбСинхронизации КАК КодХарактеристики,
	|	ДанныеТоваров.Номенклатура КАК Ссылка,
	|	ЕСТЬNULL(ТоварыОстатки.КоличествоОстаток,0) - ЕСТЬNULL(РезервыОстатки.КоличествоОстаток, 0) + ЕСТЬNULL(СД_ТоварыКонтрагента.Остаток, 0) КАК Кво,
	|	ДанныеТоваров.Номенклатура.Код КАК Код,
	|	ДанныеТоваров.Номенклатура.Артикул КАК Артикул,
	|	ВЫБОР
	|		КОГДА сви_ИзмененияФотографийНоменклатуры.Номенклатура ЕСТЬ NULL
	|			ТОГДА ЛОЖЬ
	|		ИНАЧЕ ИСТИНА
	|	КОНЕЦ КАК ВыгружатьФото,
	|	ЕСТЬNULL(ШтрихкодыХарактеристик.Штрихкод, ШтрихкодыТоваров.Штрихкод) КАК Штрихко,
	|	ЕСТЬNULL(ТоварыОстатки.КоличествоОстаток, 0) - ЕСТЬNULL(РезервыОстатки.КоличествоОстаток, 0) КАК НашОстаток_СД,
	|	ЕСТЬNULL(СД_ТоварыКонтрагента.Остаток, 0) КАК ОстатокПоставщика_СД
	|ИЗ
	|	ДанныеТоваров КАК ДанныеТоваров
	|		ЛЕВОЕ СОЕДИНЕНИЕ РегистрНакопления.ТоварыНаСкладах.Остатки(
	|				,
	|				1 = 1
	|					И (Склад = &МХ
	|						ИЛИ НЕ &МХЗаполнен)) КАК ТоварыОстатки
	|		ПО ДанныеТоваров.Номенклатура = ТоварыОстатки.Номенклатура
	|			И ДанныеТоваров.Характеристика = ТоварыОстатки.ХарактеристикаНоменклатуры
	|		ЛЕВОЕ СОЕДИНЕНИЕ РегистрНакопления.ТоварыВРезервеНаСкладах.Остатки(
	|				,
	|				1 = 1
	|					И 2 = 2
	|					И (Склад = &МХ
	|						ИЛИ НЕ &МХЗаполнен)) КАК РезервыОстатки
	|		ПО ДанныеТоваров.Номенклатура = РезервыОстатки.Номенклатура
	|			И ДанныеТоваров.Характеристика = РезервыОстатки.ХарактеристикаНоменклатуры
	|		ЛЕВОЕ СОЕДИНЕНИЕ РегистрСведений.сви_ИзмененияФотографийНоменклатуры КАК сви_ИзмененияФотографийНоменклатуры
	|		ПО (сви_ИзмененияФотографийНоменклатуры.Номенклатура = ДанныеТоваров.Номенклатура)
	|		ЛЕВОЕ СОЕДИНЕНИЕ ШтрихкодыТоваров КАК ШтрихкодыТоваров
	|		ПО ДанныеТоваров.Номенклатура = ШтрихкодыТоваров.Владелец
	|			И (ДанныеТоваров.Характеристика = ЗНАЧЕНИЕ(Справочник.ХарактеристикиНоменклатуры.ПустаяСсылка))
	|		ЛЕВОЕ СОЕДИНЕНИЕ ШтрихкодыХарактеристик КАК ШтрихкодыХарактеристик
	|		ПО ДанныеТоваров.Характеристика = ШтрихкодыХарактеристик.ХарактеристикаНоменклатуры
	|			И ДанныеТоваров.Номенклатура = ШтрихкодыХарактеристик.Владелец
	|		ЛЕВОЕ СОЕДИНЕНИЕ СД_ТоварыКонтрагента КАК СД_ТоварыКонтрагента
	|		ПО ДанныеТоваров.Номенклатура = СД_ТоварыКонтрагента.Ссылка";
	
	Запрос = Новый Запрос;
	
	Если НЕ СхемаОбмена.ОстаткиИзВсехМест Тогда
		ТекстЗапроса = СтрЗаменить(ТекстЗапроса, "1 = 1", "Склад В (&Склады)");
		Запрос.УстановитьПараметр("Склады", СхемаОбмена.Склады.ВыгрузитьКолонку("Склад"));
	КонецЕсли;	
	Если СхемаОбмена.ВыгружатьСвободныйОстаток = Ложь Тогда
		ТекстЗапроса = СтрЗаменить(ТекстЗапроса, "2 = 2", "ЛОЖЬ");
	КонецЕсли;	
		
	Запрос.Текст = ТекстЗапроса;
	Запрос.УстановитьПараметр("МХ",МестоХранения);
	Запрос.УстановитьПараметр("МХЗаполнен",ЗначениеЗаполнено(МестоХранения));
	Запрос.УстановитьПараметр("ТипЦен",ТипЦен);
	Запрос.УстановитьПараметр("ТипЦенСтарая",ТипЦенСтарая);
	Запрос.УстановитьПараметр("НоменклатураПоОтбору",НоменклатураПоОтбору);
	Запрос.УстановитьПараметр("ПодлежитПередаче", ПодлежитПередаче); 
	//с.д.(
	Запрос.УстановитьПараметр("ГОРОДА",СхемаОбмена.СписокГородов_СД.ВыгрузитьКолонку("Город"));
	Запрос.УстановитьПараметр("Поставщик",СхемаОбмена.СписокПоставщиков_СД.ВыгрузитьКолонку("Поставщик"));
	Запрос.УстановитьПараметр("Контрагенты",СхемаОбмена.СписокКонтрагентов_СД.ВыгрузитьКолонку("Контрагент"));
	//с.д.)
	
	курсВалюты = МодульВалютногоУчета.ПолучитьКурсВалюты(Валюта,ТекущаяДата());
	ИмяРеквизитаИдентификатора = СокрЛП(СхемаОбмена.РеквизитИдентификацииНоменклатуры);
	
	Запрос.УстановитьПараметр("ИмяРеквизита", ИмяРеквизитаИдентификатора);
	
	Выборка = Запрос.Выполнить().Выбрать(); 
	
	//с.д.(
	//ТаблОстатковКонтр = ПолучитьОстаткиКонтрагентов();
	//с.д.)
	
	Пока Выборка.Следующий() Цикл
		////с.д.( на прохання Тараса
		Если не Выборка.Ссылка.Активная_СайтХорошоп_СД Тогда
			Продолжить;
		КонецЕсли;
		////с.д.)
		НовСтр = Товары.Добавить();
		НовСтр.Номенклатура = Выборка.Ссылка;
		НовСтр.Характеристика = Выборка.Характеристика;
		
		НовСтр.ИД = Выборка[ИмяРеквизитаИдентификатора];
		Если ИмяРеквизитаИдентификатора <> "Штрихкод" И ЗначениеЗаполнено(Выборка.КодХарактеристики) тогда
			НовСтр.ИД = Выборка.КодХарактеристики;
		КонецЕсли;	
		//с.д.( 
		НовСтр.Остаток 		= Выборка.Кво;
		//НайденОстКонтр = ТаблОстатковКонтр.найти(НовСтр.Номенклатура);
		//Если НайденОстКонтр = Неопределено Тогда
		//	ОстатокКонтр = 0;
		//Иначе
		//	ОстатокКонтр = НайденОстКонтр.Остаток;	
		//КонецЕсли;
		//НовСтр.Остаток 		= ?(Выборка.Кво = NULL,0,Выборка.Кво) + ОстатокКонтр; 
		//НовСтр.Страна		= Выборка.Страна;
		//НовСтр.ДатаПроизводства		= Выборка.ДатаПроизводства;
		//с.д.)
		
		НовСтр.ВыгружатьКартинки		= Выборка.ВыгружатьФото;
		
		//Если Выборка.Цена <> 0 Тогда
		//	курсВалютыНач = МодульВалютногоУчета.ПолучитьКурсВалюты(Выборка.Валюта,ТекущаяДата());
		//	НовСтр.Цена 		= МодульВалютногоУчета.ПересчитатьИзВалютыВВалюту(Выборка.Цена,Выборка.Валюта,Валюта,курсВалютыНач.Курс,курсВалюты.Курс,курсВалютыНач.Кратность,курсВалюты.Кратность);
		//КонецЕсли;
		//Если Выборка.ЦенаСтарая <> 0 Тогда
		//	курсВалютыНач = МодульВалютногоУчета.ПолучитьКурсВалюты(Выборка.ВалютаСтарая,ТекущаяДата());
		//	НовСтр.ЦенаСтарая = МодульВалютногоУчета.ПересчитатьИзВалютыВВалюту(Выборка.ЦенаСтарая,Выборка.ВалютаСтарая,Валюта,курсВалютыНач.Курс,курсВалюты.Курс,курсВалютыНач.Кратность,курсВалюты.Кратность);
		//КонецЕсли; 
		
		//с.д.(
		НовСтр.ОстатокПоставщика_СД = Выборка.ОстатокПоставщика_СД;
		НовСтр.НашОстаток_СД = Выборка.НашОстаток_СД;
		//с.д.)
	КонецЦикла;
	
	ЗаполнитьЦенуВТаблицу(ТипЦенСтарая,"ЦенаСтарая");
	ЗаполнитьЦенуВТаблицу(ТипЦен,"Цена");
КонецПроцедуры

Процедура ЗаполнитьЦенуВТаблицу(ТипЦ,ИмяКолонки)
	СтруктураЗначений = Новый Структура;
	СтруктураЗначений.Вставить("НовыйТипЦен", ТипЦ);

	ЗапросПоЦенам = Ценообразование.СформироватьЗапросПоЦенам(СтруктураЗначений,
	   Перечисления.СпособыЗаполненияЦен.ПоЦенамНоменклатуры,
	   Товары.ВыгрузитьКолонку("Номенклатура"),
	   //с.д.(
	   //ТекущаяДата(),
	   КонецГода(КонецГода(ТекущаяДата())+1),
	   //с.д.)
	   Неопределено).Выгрузить();
	ЗапросПоЦенам.Индексы.Добавить("Номенклатура");
	
	ПустаяХарактеристика = Справочники.ХарактеристикиНоменклатуры.ПустаяСсылка();
	ТипЦенРассчитывается = ТипЦен.Рассчитывается;

	СтруктураКурса = МодульВалютногоУчета.ПолучитьКурсВалюты(Валюта, ТекущаяДата());
	Курс = СтруктураКурса.Курс;
	Кратность = СтруктураКурса.Кратность;

	Для Каждого СтрокаТовара Из Товары Цикл
		ХарактеристикаНоменклатуры = СтрокаТовара.Характеристика;

		СтруктураПоиска = Новый Структура("Номенклатура", СтрокаТовара.Номенклатура);

		СтрокиЦен = ЗапросПоЦенам.НайтиСтроки(СтруктураПоиска);

		СтрокаБезХарактеристики = Неопределено;
		СтрокаСХарактеристикой = Неопределено;

		Для Каждого СтрокаЦен Из СтрокиЦен Цикл
			Если СтрокаЦен.ХарактеристикаНоменклатуры = ПустаяХарактеристика Тогда
				СтрокаБезХарактеристики = СтрокаЦен;
			ИначеЕсли СтрокаЦен.ХарактеристикаНоменклатуры = ХарактеристикаНоменклатуры Тогда
				СтрокаСХарактеристикой = СтрокаЦен;
			КонецЕсли;
		КонецЦикла;

		Если СтрокаСХарактеристикой <> Неопределено Тогда
			НайденнаяСтрока = СтрокаСХарактеристикой;
		ИначеЕсли СтрокаБезХарактеристики <> Неопределено Тогда
			НайденнаяСтрока = СтрокаБезХарактеристики;
		Иначе
			НайденнаяСтрока = Неопределено;
		КонецЕсли;

		Если (НайденнаяСтрока <> Неопределено) И (НайденнаяСтрока.Цена <> 0) Тогда
			Цена = НайденнаяСтрока.Цена * (1 + ?(ТипЦенРассчитывается, НайденнаяСтрока.ПроцентСкидкиНаценки / 100, 0));
			Цена = Ценообразование.ОкруглитьЦену(Цена, ТипЦен.ПорядокОкругления, ТипЦен.ОкруглятьВБольшуюСторону);
			Цена = Ценообразование.ПересчитатьЦенуПриИзмененииВалюты(Цена, НайденнаяСтрока.ВалютаЦены, Валюта, Курс, Кратность);
		Иначе
			Цена = 0;
		КонецЕсли;

		СтрокаТовара[ИмяКолонки] = Цена;
		//с.д.(
		Если ИмяКолонки = "ЦенаСтарая" Тогда
			Если не СтрокаТовара.Номенклатура.ПроцентНаценки_НашСклад_СД = 0 и не СтрокаТовара.НашОстаток_СД = 0 Тогда
				СтрокаТовара[ИмяКолонки] = Цена + (Цена / 100 * СтрокаТовара.Номенклатура.ПроцентНаценки_НашСклад_СД);	
			КонецЕсли;
			Если не СтрокаТовара.Номенклатура.ПроцентНаценки_СкладПоставщика_СД = 0 и не СтрокаТовара.ОстатокПоставщика_СД = 0 и СтрокаТовара.НашОстаток_СД = 0 Тогда
				СтрокаТовара[ИмяКолонки] = Цена + (Цена / 100 * СтрокаТовара.Номенклатура.ПроцентНаценки_СкладПоставщика_СД);	
			КонецЕсли; 
		КонецЕсли;
		//с.д.)		
		//что бы не получить ошибку от сайта, если цена не заполнена, то заполним значением старой цены.
		Если ИмяКолонки = "Цена" Тогда
			Если Цена = 0 Тогда
				СтрокаТовара.Цена = СтрокаТовара.ЦенаСтарая;
			КонецЕсли;	
		КонецЕсли;	
	КонецЦикла;
КонецПроцедуры	

Функция ПолучитьНоменклатуруПоОтбору()
	
	СхемаКомпоновкиДанных = ПолучитьМакет("Макет");

    //создадим компоновщик настроек и загрузим настройки по умолчанию, вместо настроек по умолчанию можно использовать восстановленные настройки
    Настройки = Компоновщик.Настройки;
    
    //Формируем макет, с помощью компоновщика макета
    КомпоновщикМакета = Новый КомпоновщикМакетаКомпоновкиДанных;

    //Передаем в макет компоновки схему, настройки и данные расшифровки
    МакетКомпоновки = КомпоновщикМакета.Выполнить(СхемаКомпоновкиДанных, Настройки,,,Тип("ГенераторМакетаКомпоновкиДанныхДляКоллекцииЗначений"));

    //Выполним компоновку с помощью процессора компоновки
    ПроцессорКомпоновкиДанных = Новый ПроцессорКомпоновкиДанных;
    ПроцессорКомпоновкиДанных.Инициализировать(МакетКомпоновки);

    //Выводим результат в табличный документ
    ПроцессорВывода = Новый ПроцессорВыводаРезультатаКомпоновкиДанныхВКоллекциюЗначений;
	Результат = Новый ТаблицаЗначений;
    ПроцессорВывода.УстановитьОбъект(Результат);

    ПроцессорВывода.Вывести(ПроцессорКомпоновкиДанных);
    Возврат Результат.ВыгрузитьКолонку("Ссылка");
	
КонецФункции	

Функция ПолучитьИзменения()
	
	Если РежимОтбора = "Товары" Тогда
		Узел = СхемаОбмена.УзелПланаОбменаТовары;
	ИначеЕсли РежимОтбора = "Цены" Тогда
		Узел = СхемаОбмена.УзелПланаОбменаЦены;
	ИначеЕсли РежимОтбора = "Остатки" Тогда
		Узел = СхемаОбмена.УзелПланаОбменаОстатки;
	Иначе
		Возврат Неопределено;
	КонецЕсли;	
	
	ЗаписьСообщения = ПланыОбмена.СоздатьЗаписьСообщения();    
	Запись = Новый ЗаписьXML;
	ИмяФайла = ПолучитьИмяВременногоФайла("xml");
	Запись.ОткрытьФайл(ИмяФайла);
	ЗаписьСообщения.НачатьЗапись(Запись, Узел);
	
	Выборка = ПланыОбмена.ВыбратьИзменения(ЗаписьСообщения.Получатель, ЗаписьСообщения.НомерСообщения);
	
	ИзмененныеТовары = Новый Массив;
	Пока Выборка.Следующий() Цикл
 		ИзмененныеТовары.Добавить(Выборка.Получить().Ссылка);
	КонецЦикла;	
		
	НомерСообщения = ЗаписьСообщения.НомерСообщения;
	ЗаписьСообщения.ЗакончитьЗапись();
	Запись.Закрыть();                                                   
	УдалитьФайлы(ИмяФайла);
	Возврат ИзмененныеТовары;
	
КонецФункции	

Процедура ВыгрузитьОстатки() Экспорт
	Если Товары.Количество()=0 Тогда
		Возврат;
	КонецЕсли;

	НастройкиПодключения = СхемаОбмена.НастройкаПодключения;
	ИмяРеквизитаИдентификатора = СокрЛП(СхемаОбмена.РеквизитИдентификацииНоменклатуры);
	
	тОст = Новый ТаблицаЗначений;
	тОст.Колонки.Добавить("КодТовара");
	тОст.Колонки.Добавить("Наличие");
	тОст.Колонки.Добавить("ВыгружатьНулевыеОстатки");
	Для Каждого Стр Из Товары Цикл
		НовСтр = тОст.Добавить();
		НовСтр.КодТовара = Стр.ИД;
		НовСтр.ВыгружатьНулевыеОстатки = ВыгружатьНулевыеОстатки;
		// ----
		НовСтр.Наличие = Стр.Остаток;
	КонецЦикла;
	Успешно = Ложь;
	мпи_Доработки.ВыгрузкаНаличия_Хорошоп(тОст,Товары,НастройкиПодключения,СхемаОбмена, Успешно);
	Если Успешно И ЗначениеЗаполнено(Узел) И ЗначениеЗаполнено(НомерСообщения) И ТипЗнч(Узел) = Тип("ПланОбменаСсылка.мпи_ОбменССайтомОстатки") Тогда
		ПланыОбмена.УдалитьРегистрациюИзменений(Узел, НомерСообщения);
	КонецЕсли; 	
КонецПроцедуры

Процедура ВыгрузитьЦены() Экспорт
	Если Товары.Количество()=0 Тогда
		Возврат;
	КонецЕсли;
	НастройкиПодключения = СхемаОбмена.НастройкаПодключения;
	ИмяРеквизитаИдентификатора = СокрЛП(СхемаОбмена.РеквизитИдентификацииНоменклатуры);
	
	тЦены = Новый ТаблицаЗначений;
	тЦены.Колонки.Добавить("КодТовара");
	
	тЦены.Колонки.Добавить("Цена");
	тЦены.Колонки.Добавить("ЦенаСтарая");
	тЦены.Колонки.Добавить("ВалютаСтр");
	тЦены.Колонки.Добавить("ВалютаИд");
	тЦены.Колонки.Добавить("ВыгружатьНулевыеЦеныПрайс");
	тЦены.Колонки.Добавить("ВыгружатьНулевыеЦеныРРЦ");
	тЦены.Колонки.Добавить("ВыгружатьНулевыеЦеныСтарая");
	//
	Если СхемаОбмена.РеквизитСинхронизацииВалюты = "Код веб-синхронизации" Тогда
	    ВалютаСтр = Валюта.КодВебСинхронизации;
	Иначе	
		ВалютаСтр = Валюта.Наименование;
	КонецЕсли;	
	
	Если ВРег(ВалютаСтр) = "ГРН" Тогда
		ВалютаСтр = "UAH";
	КонецЕсли;	
	ВалютаИД = Неопределено;
	Для Каждого Стр Из Товары Цикл
		НовСтр = тЦены.Добавить();
		НовСтр.КодТовара = Стр.ИД;
		// ----
		НовСтр.Цена          = Стр.Цена;
		НовСтр.ЦенаСтарая    = Стр.ЦенаСтарая;
		НовСтр.ВалютаСтр     = ВалютаСтр;
		НовСтр.ВалютаИД      = ВалютаИД;
		НовСтр.ВыгружатьНулевыеЦеныПрайс 	= ВыгружатьНулевыеЦеныПрайс;
		НовСтр.ВыгружатьНулевыеЦеныСтарая	= ВыгружатьНулевыеЦеныСтарая;
	КонецЦикла;
	Успешно = Ложь;
	мпи_Доработки.ВыгрузкаЦен_Хорошоп(тЦены,Товары,НастройкиПодключения,,СхемаОбмена,Успешно);
	Если Успешно И ЗначениеЗаполнено(Узел) И ЗначениеЗаполнено(НомерСообщения) И ТипЗнч(Узел) = Тип("ПланОбменаСсылка.мпи_ОбменССайтомЦены") Тогда
		ПланыОбмена.УдалитьРегистрациюИзменений(Узел, НомерСообщения);
	КонецЕсли; 	
КонецПроцедуры

Функция ВосстановитьНастройки(ЭлементыФормы) Экспорт
	Перем СохраненнаяНастройка;
	СтруктураНастройки = Новый Структура;
	СтруктураНастройки.Вставить("Пользователь", глЗначениеПеременной("глТекущийПользователь"));
	СтруктураНастройки.Вставить("ИмяОбъекта", Строка(ЭтотОбъект));
	СтруктураНастройки.Вставить("НаименованиеНастройки", ?(мТекущаяНастройка = Неопределено, Неопределено, мТекущаяНастройка.НаименованиеНастройки));
	Результат = УниверсальныеМеханизмы.ВосстановлениеНастроек(СтруктураНастройки);
	Если Результат <> Неопределено Тогда
		мТекущаяНастройка = Результат;
		ВосстановитьНастройкиИзСтруктуры(Результат.СохраненнаяНастройка);
	Иначе
		мТекущаяНастройка = СтруктураНастройки;
	КонецЕсли;
КонецФункции

Функция ВосстановитьНастройкиИзСтруктуры(СтруктураСНастройками, Отчет = Неопределено) Экспорт
	ЗаполнитьЗначенияСвойств(ЭтотОбъект,СтруктураСНастройками);
	Настройки = СтруктураСНастройками.КомпоновщикНастройки.Получить();
	Компоновщик.ЗагрузитьНастройки(Настройки);
	
	Возврат Истина;
КонецФункции

Процедура СохранитьНастройки(ЭлементыФормы) Экспорт
	Перем СохраненнаяНастройка;
	СформироватьСтруктуруДляСохраненияНастроек(СохраненнаяНастройка);
	СтруктураНастройки = Новый Структура;
	СтруктураНастройки.Вставить("Пользователь", глЗначениеПеременной("глТекущийПользователь"));
	СтруктураНастройки.Вставить("ИмяОбъекта", Строка(ЭтотОбъект));
	СтруктураНастройки.Вставить("НаименованиеНастройки", ?(мТекущаяНастройка = Неопределено, Неопределено, мТекущаяНастройка.НаименованиеНастройки));
	СтруктураНастройки.Вставить("СохраненнаяНастройка", СохраненнаяНастройка);
	СтруктураНастройки.Вставить("ИспользоватьПриОткрытии", Ложь);
	СтруктураНастройки.Вставить("СохранятьАвтоматически", Ложь);
	СтруктураНастройки.Вставить("ВыгружатьНулевыеОстатки", ВыгружатьНулевыеОстатки);
	СтруктураНастройки.Вставить("ВыгружатьНулевыеЦеныПрайс", ВыгружатьНулевыеЦеныПрайс);
	СтруктураНастройки.Вставить("ВыгружатьНулевыеЦеныСтарая", ВыгружатьНулевыеЦеныСтарая);
	СтруктураНастройки.Вставить("Валюта", Валюта);
	Результат = УниверсальныеМеханизмы.СохранениеНастроек(СтруктураНастройки);
	Если Результат <> Неопределено Тогда
		мТекущаяНастройка = Результат;
	Иначе
		мТекущаяНастройка = СтруктураНастройки;
	КонецЕсли;
КонецПроцедуры

Процедура СформироватьСтруктуруДляСохраненияНастроек(СтруктураСНастройками) Экспорт
	Если ТипЗнч(СтруктураСНастройками) <> Тип("Структура") Тогда
		СтруктураСНастройками = Новый Структура;
	КонецЕсли;
	//СтруктураСНастройками.Вставить("ТипДиаграммыОтчета", ТипДиаграммыОтчета);
	СтруктураСНастройками.Вставить("МестоХранения", МестоХранения);
	СтруктураСНастройками.Вставить("Валюта", Валюта);
	СтруктураСНастройками.Вставить("КомпоновщикНастройки", Новый ХранилищеЗначения(Компоновщик.Настройки));
КонецПроцедуры

Процедура ЗаполнитьПоСхемеОбмена() Экспорт
	
	ТипЦен 			= СхемаОбмена.ТипЦеныПрайс;
	ТипЦенСтарая 	= СхемаОбмена.ТипЦеныСтарая;
	
	ВыгружатьНулевыеЦеныПрайс  = СхемаОбмена.ВыгружатьНулевыеЦеныПрайс;
	ВыгружатьНулевыеЦеныСтарая = СхемаОбмена.ВыгружатьНулевыеЦеныСтарая;
	ВыгружатьНулевыеОстатки    = СхемаОбмена.ВыгружатьНулевыеОстатки;
	
	Валюта 			= СхемаОбмена.ВалютаНоменклатурыИЦенНаСайте;
	
КонецПроцедуры	

//с.д.(
Функция ПолучитьОстаткиКонтрагентов()
	
	Запрос = Новый Запрос;
	ТекстЗапроса = 
	"ВЫБРАТЬ
	|	Ном.Ссылка,
	|	ЕСТЬNULL(ВложенныйЗапрос1.Остаток, 0) КАК Остаток
	|ИЗ
	|	Справочник.Номенклатура КАК Ном
	|		ЛЕВОЕ СОЕДИНЕНИЕ (ВЫБРАТЬ
	|			ЦеныНоменклатурыКонтрагентовСрезПоследних.Номенклатура КАК Номенклатура,
	|			ЦеныНоменклатурыКонтрагентовСрезПоследних.Остаток КАК Остаток
	|		ИЗ
	|			РегистрСведений.ЦеныНоменклатурыКонтрагентов.СрезПоследних КАК ЦеныНоменклатурыКонтрагентовСрезПоследних";
	Если СхемаОбмена.ОтборОстатковПоГородам_СД или СхемаОбмена.ОтборОстатковПоПоставщикам_СД Тогда
		ТекстЗапроса = ТекстЗапроса +"
		|		ГДЕ";
	КонецЕсли;
	Если СхемаОбмена.ОтборОстатковПоГородам_СД Тогда
		Если СхемаОбмена.ИсключатьГорода_СД Тогда
			ТекстЗапроса = ТекстЗапроса +"
			|		НЕ 	ЦеныНоменклатурыКонтрагентовСрезПоследних.МІСТО В(&ГОРОДА)"; 
		Иначе
			ТекстЗапроса = ТекстЗапроса +"
			|			ЦеныНоменклатурыКонтрагентовСрезПоследних.МІСТО В(&ГОРОДА)"; 
		КонецЕсли;
	КонецЕсли;
	Если СхемаОбмена.ОтборОстатковПоПоставщикам_СД Тогда
		Если СхемаОбмена.ИсключатьПоставщиков_СД Тогда
			ТекстЗапроса = ТекстЗапроса +"
			|		НЕ 	ЦеныНоменклатурыКонтрагентовСрезПоследних.Поставщик В(&Поставщик)"; 
		Иначе
			ТекстЗапроса = ТекстЗапроса +"
			|			ЦеныНоменклатурыКонтрагентовСрезПоследних.Поставщик В(&Поставщик)"; 
		КонецЕсли;
	КонецЕсли;
	
	ТекстЗапроса = ТекстЗапроса + ") КАК ВложенныйЗапрос1
	|		ПО Ном.Ссылка = ВложенныйЗапрос1.Номенклатура";
	

	
	Запрос.Текст = ТекстЗапроса;
	Запрос.УстановитьПараметр("ГОРОДА",СхемаОбмена.СписокГородов_СД.ВыгрузитьКолонку("Город"));
	Запрос.УстановитьПараметр("Поставщик",СхемаОбмена.СписокПоставщиков_СД.ВыгрузитьКолонку("Поставщик"));
	
	РезультатЗапроса = Запрос.Выполнить();
	
	ВыборкаДетальныеЗаписи = РезультатЗапроса.Выгрузить();
	
	Возврат ВыборкаДетальныеЗаписи;	
	
КонецФункции
//с.д.)

Схема = ПолучитьМакет("Макет");
Компоновщик.Инициализировать(Новый ИсточникДоступныхНастроекКомпоновкиДанных(Схема));
Компоновщик.ЗагрузитьНастройки(Схема.НастройкиПоУмолчанию);

//
